Autodesk.Revit.UI.UIDocument.UpdateAllOpenViews
Update all open views in this document after elements have been changed, deleted, selected or de-selected.
Graphics in the views are fully redrawn regardless of which elements have changed.
Remarks:
This function should only rarely be needed, but might be required when working with graphics drawn from outside of Revit's transactions and elements,
for example, when using Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.
This function is potentially expensive as many views may be updated at once, including regeneration of view's geometry and redisplay of graphics.
Thus for most situations it is recommended that API applications rely on the Revit application framework to update views more deliberately.
Since:
2018

Autodesk.Revit.UI.UIDocument.GetPlacementTypes(Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.View)
Get a collection of valid placement types for input family symbol.
familySymbol:
The family symbol.
pDBView:
The view in which the family instance will be placed in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.UIDocument.SaveAs(Autodesk.Revit.UI.UISaveAsOptions)
Saves the document to a file name obtained from the Revit user optionally prompting the user to overwrite file if it exists.
Remarks:
This method may not be called unless all transactions, sub-transactions, and transaction groups that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
options:
UI options for the SaveAs operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to save the document.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Thrown if saving is cancelled by an external application during 'DocumentSavingAs' event.
Since:
2016

Autodesk.Revit.UI.UIDocument.SaveAs
Saves the document to a file name obtained from the Revit user without prompting the user to overwrite file if it exists.
Remarks:
This method may not be called unless all transactions, sub-transactions, and transaction groups that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to save the document.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Thrown if saving is cancelled by an external application during 'DocumentSavingAs' event.

Autodesk.Revit.UI.UIDocument.CanPlaceElementType(Autodesk.Revit.DB.ElementType)
Verifies that the user can be prompted to place the input element type interactively.
Remarks:
If an element type can be placed interactively, it may be used as input to Autodesk.Revit.UI.UIDocument.PostRequestForElementTypePlacement(Autodesk.Revit.DB.ElementType)
to have the user place an instance of the element. However, this function does not evaluate whether that element instance may
actually be placed in the current active view.
elementType:
The ElementType.
Returns:
True if the user can be prompted to place the input element type interactively, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.UI.UIDocument.PromptToMatchElementType(Autodesk.Revit.DB.ElementType)
Prompts the user to select elements to change them to the input type.
Remarks:
This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
In a single invocation, the user can select multiple elements to be modified to the given type, until they finish.
elementType:
The ElementType applied to selected instances.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This document is not the currently active one.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction.
Since:
2015

Autodesk.Revit.UI.UIDocument.PromptToPlaceElementTypeOnLegendView(Autodesk.Revit.DB.ElementType)
Prompts the user to place an element type onto a legend view.
Remarks:
This method works only for non-annotation element types.
For annotations, use PromptForFamilyInstancePlacement(Autodesk::Revit::DB::FamilySymbol) instead.
This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
The user is not permitted to change the active legend view or
during this placement operation (the operation will be cancelled).
In a single invocation, the user can place multiple instances of the input element type until they finish the
placement (with Cancel or ESC or a click elsewhere in the UI).
elementType:
The ElementType of which instances are to be placed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input element type does not belong to a model-level category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This document is not the currently active one.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction.
-or-
Thrown when the active view isn't a legend view.
-or-
Can not create this kind of element in legend view.
Since:
2015

Autodesk.Revit.UI.UIDocument.PostRequestForElementTypePlacement(Autodesk.Revit.DB.ElementType)
Places a request on Revit's command queue for the user to place instances of the specified ElementType.  This does not execute immediately,
but instead when control returns to Revit from the current API context.
Remarks:
This method starts its own transaction.  In a single invocation, the user can place multiple instances of the input element type
until they finish the placement (with Cancel or ESC or a click elsewhere in the UI).  This method invokes the UI when control returns
from the current API context; because of this, the normal Revit UI options will be available to the user,  but the API will not be
notified when the user has completed this action.  Because this request is queued to run at the end of the current API context,
only one such request can be set (between this and the commands set by UIApplication.PostCommand()).  This differs from
PromptForFamilyInstancePlacement() as that method can be run within the current API context, but the user is not permitted
full access to the user interface options during placement.
elementType:
The ElementType of which instances are to be placed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The user cannot be prompted to place the input type interactively.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This document is not the currently active one.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction.
Since:
2015

Autodesk.Revit.UI.UIDocument.PromptToPlaceViewOnSheet(Autodesk.Revit.DB.View,System.Boolean)
Prompts the user to place a specified view onto a sheet.
Remarks:
This method opens its own transaction, so it's not permitted to be invoked in an active transaction.
In a single invocation, the user can place only one view onto the active sheet.
The user is not permitted to change the active sheet view or the view to be placed
during this placement operation (the operation will be cancelled).
The user can cancel the placement operation by pressing Cancel or ESC or a click elsewhere in the UI.
This method can't be used to place a schedule on a sheet.
Use Autodesk.Revit.DB.ScheduleSheetInstance Create() to add schedules to sheets.
view:
The view to insert onto a sheet.
allowReplaceExistingSheetViewport:
A indicator which allows the user to replace the existing viewport.
If true, the viewport representing this view will be replaced by the new viewport created during placement.
If the view is allowed only to be on one sheet, this will remove the viewport from the old sheet.
If the view is allowed to be on multiple sheets, and the view is currently placed on the active sheet,
the old viewport on this sheet will be replaced.
If false, if the view is only allowed to be on one sheet,
or if the view is allowed to be on multiple sheets but is already on the active sheet, an exception will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This view is a view template.
-or-
view is a schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This document is not the currently active one.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction.
-or-
The active view isn't a sheet where a view can be placed.
-or-
The view can't be placed on the sheet.  For schedule views use ScheduleSheetInstance::Create() to place them on sheets.
-or-
Thrown when replacing an existing viewport isn't allowed. See allowReplaceExistingSheetViewport parameter documentation for details.
Since:
2015

Autodesk.Revit.UI.UIDocument.GetSketchGalleryOptions(Autodesk.Revit.DB.FamilySymbol)
Gets the valid sketch gallery options of a family symbol.
familySymbol:
The family symbol.
Returns:
The valid list of SketchGalleryOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.UIDocument.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.UIDocument.ActiveGraphicalView
The currently active graphical view of the currently active document.
Remarks:
This property is applicable to the currently active document only.
Returns null if this document doesn't represent the active document.
Since:
2015

Autodesk.Revit.UI.UIDocument.GetOpenUIViews
Get a list of all open view windows in the Revit user interface.
Remarks: A sheet view with an activated viewport will return the view associated with the activated viewport, not the sheet view.

Autodesk.Revit.UI.UIDocument.Application
Retrieves an object that represents the current Application.

Autodesk.Revit.UI.UIDocument.PromptForFamilyInstancePlacement(Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions)
Prompts the user to place instances of the specified FamilySymbol.
familySymbol: The FamilySymbol.
options: The PromptForFamilyInstancePlacementOptions, to place the family instance according to the options.
Remarks:
This method opens its own transaction, so it's not permitted to be invoked in an active transaction.
In a single invocation, the user can place multiple instances of the input family type until they finish the
placement (with Cancel or ESC or a click elsewhere in the UI). The user will not be permitted to change the type to be placed.
Users are not permitted to change the active view during this placement operation (the operation will be completed).
This method differs from Autodesk.Revit.UI.UIDocument.PostRequestForElementTypePlacement(Autodesk.Revit.DB.ElementType) in that it will execute immediately
within the current API context and return to the application when the user completes or cancels the operation.  However,
it does not allow the user access to user interface options and settings related to the placement.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when
the family symbol should be of category OST_DuctTerminal because PlaceAirTerminalOnDuct in options is true,
or the sketch gallery options in options is invalid,
or the placement type for the family symbol in options is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when
this API method is invoked in an active transaction,
or this document is not active,
or this is a family document and the instances of this family symbol can not exist in the current family,
or this family symbol has no command to create instance,
or the command to create instance is disabled in active view.
Since: 2015

Autodesk.Revit.UI.UIDocument.PromptForFamilyInstancePlacement(Autodesk.Revit.DB.FamilySymbol)
Prompts the user to place instances of the specified FamilySymbol.
familySymbol: The FamilySymbol.
Remarks:
This method opens its own transaction, so it's not permitted to be invoked in an active transaction.
In a single invocation, the user can place multiple instances of the input family type until they finish the
placement (with Cancel or ESC or a click elsewhere in the UI). The user will not be permitted to change the type to be placed.
Users are not permitted to change the active view during this placement operation (the operation will be completed).
This method differs from Autodesk.Revit.UI.UIDocument.PostRequestForElementTypePlacement(Autodesk.Revit.DB.ElementType) in that it will execute immediately
within the current API context and return to the application when the user completes or cancels the operation.  However,
it does not allow the user access to user interface options and settings related to the placement.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when
this API method is invoked in an active transaction,
or this document is not active,
or this is a family document and the instances of this family symbol can not exist in the current family,
or this family symbol has no command to create instance,
or the command to create instance is disabled in active view.
Since: 2011

Autodesk.Revit.UI.UIDocument.RequestViewChange(Autodesk.Revit.DB.View)
Requests an asynchronous change of the active view in the currently active document.
view: The View.
Since: 2015
Remarks:
This method requests to change the active view by posting a message asynchronously.
Unlike setting the Autodesk.Revit.UI.UIDocument.ActiveView property,
this will not make the change in active view immediately. Instead the request will be posted
to occur when control returns to Revit from the API context. This method is permitted to change
the active view from the Idling event or an ExternalEvent callback.
The active view cannot be changed when:
There is an open transaction in the currently active document.Autodesk.Revit.DB.Document.IsModifiable is true.Autodesk.Revit.DB.Document.IsReadOnly is true.ViewActivating, ViewActivated, or any pre-event (such as DocumentSaving) is being handled.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If the 'view' argument is NULL.
Throws Autodesk.Revit.Exceptions.ArgumentException:
If the given view is not a valid view of the document; -or-
If the given view is a template view; -or-
If the given view is an internal view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If the given view is not from the currently active document; -or-
If the active document is currently modifiable (i.e. with an active transaction); -or-
If the active document is currently in read-only state; -or-
During either ViewActivating or ViewActivated event; -or-
During any pre-action kind of event, such as DocumentSaving, etc.

Autodesk.Revit.UI.UIDocument.Document
Returns the database level document represented by this UI-level document.

Autodesk.Revit.UI.UIDocument.ActiveView
The currently active view of the currently active document.
Since: 2012
Remarks:
This property is applicable to the currently active document only.
Returns null if this document doesn't represent the active document.
The active view can only be changed when:
There is no open transaction.Autodesk.Revit.DB.Document.IsModifiable is false.Autodesk.Revit.DB.Document.IsReadOnly is false.ViewActivating, ViewActivated, and any pre-action of events (such as DocumentSaving or DocumentClosingevents) are not being handled.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting the property: If the 'view' argument is NULL.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting the property:
If the given view is not a valid view of the document; -or-If the given view is a template view; -or-If the given view is an internal view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting the property:
If the document is not currently active; -or-If the document is currently modifiable (i.e. with an active transaction); -or-If the document is currently in read-only state; -or-When invoked during either ViewActivating or ViewActivated event; -or-When invoked during any pre-action kind of event, such as DocumentSaving, DocumentClosing, etc.

Autodesk.Revit.UI.UIDocument.RefreshActiveView
Refresh the display of the active view in the active document.
Since: 2011

Autodesk.Revit.UI.UIDocument.ShowElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Shows the elements by zoom to fit.
elementIds: The set of element ids which will be shown.
Remarks: Places all the elements on the screen by moving the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: elementIds is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Member of elementIds is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Member of elementIds is not valid.

Autodesk.Revit.UI.UIDocument.ShowElements(Autodesk.Revit.DB.ElementSet)
Shows the elements by zoom to fit.
elements: The set of elements that will be shown.
Remarks: Places all the elements on the screen by moving the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Elements is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Member of elements is null.

Autodesk.Revit.UI.UIDocument.ShowElements(Autodesk.Revit.DB.Element)
Shows the element by zoom to fit.
element: Element that will be shown.
Remarks: Places the element in the center of screen by moving the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Element is null.

Autodesk.Revit.UI.UIDocument.ShowElements(Autodesk.Revit.DB.ElementId)
Shows one or more elements by zoom to fit.
Shows the element by zoom to fit.
elementId: Element id that will be shown.
Remarks: Places the element in the center of screen by moving the view.
Throws Autodesk.Revit.Exceptions.ArgumentException: Element id is not valid.

Autodesk.Revit.UI.UIDocument.SaveAndClose
Close the document, prompting the user for saving it when necessary.
Returns: False if closing procedure fails or if saving of a modified document was requested but failed.
Also returns False if closing is cancelled by an external application during 'DocumentClosing' event.
When function succeeds, True is returned.
Remarks: UI dialogs may be shown during the call (e.g. when the document has been changed since last time it was saved) to get user responses.
The currently active document may not be closed by this function. It can only be closed via Revit's UI.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when attempting to close the currently active document.
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to close the document.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if this a linked file.

Autodesk.Revit.UI.UIDocument.Selection
Retrieve the currently selected Elements in Autodesk Revit.
Remarks: Returns an object that represents the active selection. The Selection property returns an
object that represents the active selection when the command was started.

Autodesk.Revit.UI.UIDocument.GetRevitUIFamilyLoadOptions
Return the option object that allows you to use Revit's dialog boxes to let the user respond to questions that arise during loading of families.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if
this API method is invoked in UI less mode

Autodesk.Revit.UI.UIDocument.#ctor(Autodesk.Revit.DB.Document)
Use a database level Document to construct a UI-level Document.
document:
The database level document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a primary document, it is a linked document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.UIDocument
An object that represents an Autodesk Revit project opened in the Revit user interface.
Remarks:
This class represents a document opened in the user interface and therefore offers interfaces
to work with settings and operations in the UI (for example, the active selection). Revit can have multiple
projects open and multiple views to those projects. The active or top most view will be the
active project and hence the active document which is available from the UIApplication object.
Obtain the database level Document (which contains interfaces not related to the UI) via the
Document property.  If you have a database level Document and need to access it from the UI, you can
construct a new UIDocument from that object (the document must be open and visible in the UI to allow the methods to
work successfully).